//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x5e2b50=_0x4ce7;(function(_0x483177,_0x5683e6){const _0x3471ec=_0x4ce7,_0x5e7503=_0x483177();while(!![]){try{const _0x467e40=-parseInt(_0x3471ec(0x1d7))/(0x3d*0xa3+0x2*-0xb6e+-0x5*0x332)+-parseInt(_0x3471ec(0x1d2))/(0x1*0x112d+0x1*-0x268d+0x1562)*(parseInt(_0x3471ec(0x1e4))/(-0x954+0x1875+0x2*-0x78f))+-parseInt(_0x3471ec(0x1ea))/(-0x16*0x40+-0x1*-0x161+-0x3*-0x161)+parseInt(_0x3471ec(0x1de))/(-0x1249*0x1+0x1*-0x1b36+0x2*0x16c2)*(parseInt(_0x3471ec(0x1f5))/(0x79f+-0x2a*-0x31+-0xfa3))+parseInt(_0x3471ec(0x1dd))/(0xa4c+-0x3*-0x787+-0x1d*0x122)+parseInt(_0x3471ec(0x1c7))/(0x1*-0xde+0x3*-0xd+0x10d)+parseInt(_0x3471ec(0x1eb))/(0x2633+0x2*0x14e+-0x28c6);if(_0x467e40===_0x5683e6)break;else _0x5e7503['push'](_0x5e7503['shift']());}catch(_0x5841fe){_0x5e7503['push'](_0x5e7503['shift']());}}}(_0x1b70,-0x1*0x23c97+0xa4d6+0x2*0x1c6be));const axios=require(_0x5e2b50(0x1cc)),cheerio=require(_0x5e2b50(0x1d3));exports[_0x5e2b50(0x1ce)]=async _0x48872d=>{const _0x1cc326=_0x5e2b50,_0x182670={'SMmKV':function(_0x27075e,_0x2bec04){return _0x27075e(_0x2bec04);},'CiWVX':_0x1cc326(0x1d6),'aKYpa':_0x1cc326(0x1e7),'Yhuoy':function(_0x5e2637,_0x27299d){return _0x5e2637&&_0x27299d;},'DxotI':function(_0x2194bc,_0x4ce1d9){return _0x2194bc(_0x4ce1d9);},'eMIcE':_0x1cc326(0x1e3)+_0x1cc326(0x1c8)+_0x1cc326(0x1cd)+_0x1cc326(0x1e2)+_0x1cc326(0x1ec)+_0x1cc326(0x1c9)+_0x1cc326(0x1ca)+_0x1cc326(0x1cf)+_0x1cc326(0x1e9)+_0x1cc326(0x1db)+_0x1cc326(0x1f0)+_0x1cc326(0x1d9),'moGKE':_0x1cc326(0x1dc),'yUASg':_0x1cc326(0x1ee)},_0x3cc07d=_0x1cc326(0x1e6)+_0x1cc326(0x1ef)+_0x1cc326(0x1e8)+'q='+_0x182670[_0x1cc326(0x1f2)](encodeURIComponent,_0x48872d)+_0x1cc326(0x1df);try{const {data:_0x495a2a}=await axios[_0x1cc326(0x1f3)](_0x3cc07d,{'headers':{'User-Agent':_0x182670[_0x1cc326(0x1d1)]}}),_0x17bfdc=cheerio[_0x1cc326(0x1da)](_0x495a2a);let _0x238d99=[];return _0x182670[_0x1cc326(0x1d0)](_0x17bfdc,_0x182670[_0x1cc326(0x1ed)])[_0x1cc326(0x1cb)]((_0x55d1cf,_0x3c0380)=>{const _0x1627b2=_0x1cc326,_0x9df610=_0x182670[_0x1627b2(0x1d0)](_0x17bfdc,_0x3c0380)[_0x1627b2(0x1c6)]('h3')[_0x1627b2(0x1f1)](),_0x809035=_0x182670[_0x1627b2(0x1d0)](_0x17bfdc,_0x3c0380)[_0x1627b2(0x1c6)]('a')[_0x1627b2(0x1d4)](_0x182670[_0x1627b2(0x1e5)]),_0x3cd065=_0x182670[_0x1627b2(0x1d0)](_0x17bfdc,_0x3c0380)[_0x1627b2(0x1c6)](_0x182670[_0x1627b2(0x1d8)])[_0x1627b2(0x1f1)]();_0x182670[_0x1627b2(0x1e0)](_0x9df610,_0x809035)&&_0x238d99[_0x1627b2(0x1e1)]({'title':_0x9df610,'link':_0x809035,'description':_0x3cd065});}),{'status':!![],'creator':_0x182670[_0x1cc326(0x1d5)],'results':_0x238d99||[]};}catch(_0x398e77){return{'status':![],'creator':_0x182670[_0x1cc326(0x1d5)],'message':_0x398e77[_0x1cc326(0x1f4)]};}};function _0x4ce7(_0x1c5927,_0x4078c0){const _0x5532b4=_0x1b70();return _0x4ce7=function(_0x1d3ed0,_0x119218){_0x1d3ed0=_0x1d3ed0-(0x11a8+-0x269b*0x1+0x16b9);let _0x39504b=_0x5532b4[_0x1d3ed0];return _0x39504b;},_0x4ce7(_0x1c5927,_0x4078c0);}function _0x1b70(){const _0x34a7f0=['load','.0.4183.12','div.g','1147573wlJcKg','16690XvAAlD','&ie=UTF-8','Yhuoy','push','Win64;\x20x64','Mozilla/5.','921rthxSJ','CiWVX','https://ww','.VwiC3b','om/search?','\x20Chrome/85','977784EWyVWE','2063124ZsaJWR',')\x20AppleWeb','moGKE','@PikaBotz','w.google.c','1\x20Safari/5','text','DxotI','get','message','108vhwTVJ','find','1624368tAvqMV','0\x20(Windows','Kit/537.36','\x20(KHTML,\x20l','each','axios','\x20NT\x2010.0;\x20','google','ike\x20Gecko)','SMmKV','eMIcE','716jnvTAs','cheerio','attr','yUASg','href','173510yhrrEA','aKYpa','37.36'];_0x1b70=function(){return _0x34a7f0;};return _0x1b70();}
