[
"Let me tie your shoes, cause I dont want you falling for anyone else.",
"Even if there wasn’t any gravity on earth, I would still fall for you!",
"Can I have your picture so I can show Santa what I want for Christmas?",
"Hi, I’m writing a term paper on the finer things in life, and I was wondering if I could interview you?",
"If a thousand painters worked for a thousand years, they could not create a work of art as beautiful as you.",
"How is your fever? [What fever?] Oh… you just look hot to me.",
"Most people like to watch the Olympics, because they only happen once every 4 years, but I’d rather talk to you cause the chance of meeting someone so special only happens once in a lifetime.",
"I’m no photographer, but I can picture us together.",
"I have to show you the prettiest girl I’ve ever seen. (show phone with frontcam)",
"Was your father a thief? ‘Cause someone stole the stars from the sky and put them in your eyes.",
"I never need to see the sun again because your eyes light up my world.",
"I sneezed because God blessed me with you.",
"Let’s commit the perfect crime: I’ll steal you’re heart, and you’ll steal mine.",
"Is your name Summer? ‘Cause you are as hot as hell.",
"I don’t know which is prettier today, the water, the sky or your eyes.",
"Do you have a sunburn, or are you always this hot?",
"My love for you is like dividing by zero– it cannot be defined.",
"Was that an earthquake or did you just rock my world?",
"What time do you have to be back in heaven?",
"See these keys? I wish I had the one to your heart.",
"If I were a stop light, I’d turn red everytime you passed by, just so I could stare at you a bit longer.",
"I’ll cook you dinner if you cook me breakfast.",
"I think I can die happy now, cause I’ve just seen a piece of heaven.",
"Was that an earthquake or did you just rock my world?",
"Life without you would be like a broken pencil… pointless.",
"I must be dancing with the devil, because you’re hot as hell.",
"Hershey’s makes millions of kisses a day.. .all I’m asking for is one from you.",
"Me without you is like a nerd without braces, A shoe without laces, aSentenceWithoutSpaces.",
"Are you a kidnapper? Because you just abducted my heart.",
"When God made you, he was showing off.",
"My buddies bet me that I wouldn’t be able to start a conversation with the most beautiful girl in the bar. Wanna buy some drinks with their money?",
"No wonder the sky is grey today, all the blue is in your eyes.",
"Can you take me to the bakery? Because, I want a Cutiepie like you!",
"Are you a magician? Because whenever I look at you everyone else disappears.",
"Stop, drop, and roll, baby. You are on fire.",
"Babe, your beauty makes the morning sun look like the dull glimmer of the moon.",
"If nothing lasts forever, will you be my nothing?",
"What are you doing for the rest of your life? Because I want to spend it with you.",
"There must be something wrong with my eyes, I can’t take them off you.",
"Most people call me @user, but you can call me tomorrow!",
"There must be something wrong with my eyes, I can’t take them off you.",
"Most people call me @user, but you can call me tomorrow!",
"I wasnt sure if you were a beautiful angel or a sexy devil, but now that I’m close I see heaven in your eyes.",
"You must be Jelly, cause jam don’t shake like that.",
"If I received a nickel for everytime I saw someone as beautiful as you, I’d have five cents.",
"I hope you know CPR, because you take my breath away!",
"Do you want to see a picture of a beautiful person? (hold up a mirror)",
"My name’s @user, but you can call me “lover.”",
"Is it hot in here or is it just you?",
"Hey, I didnt know angels flew so low.",
"Are you Cinderella? Cause’ I see that dress coming off at midnight!",
"There is something wrong with my cell phone. It doesn’t have your number in it.",
"Looks like you dropped something , My jaw!",
"You know, Dr. Phil says I’m afraid of commitment…Want to help prove him wrong?",
"Were you in Boy Scouts? Because you sure have tied my heart in a knot.",
"The drink: $6. The room: $100. The night with you?: Priceless.",
"Baby, if you were words on a page, you’d be what they call FINE PRINT!",
"If you were a chicken, you’d be impeccable.",
"I think there’s something wrong with my eyes because I can’t take them off you.",
"Did you have lucky charms for breakfast? Because you look magically delicious!",
"Your lips look so lonely…Would they like to meet mine?",
"I think there’s something wrong with my eyes because I can’t take them off you.",
"Did you have lucky charms for breakfast? Because you look magically delicious!",
"Excuse me, I think you have something in your eye. Oh wait, it’s just a sparkle.",
"Do you like soda? Because I’d mount-and-do you. (Mountain Dew)",
"Please call an ambulance, your beauty is killing me!",
"Girl, you got more legs than a bucket of chicken!",
"How was heaven when you left it?",
"Hey, don’t I know you? Yeah, you’re the girl with the beautiful smile.",
"If God made anything more beautiful than you, I’m sure he’d keep it for himself.",
"Are you lost ma’am? Because heaven is a long way from here.",
"I wish I was cross-eyed, so I could see you twice.",
"They say a girls best friend are her legs. But even the best of friends sometimes have to part.",
"It’s not my fault that I fell for you, you tripped me!",
"Baby, you’re so sweet, you put Hershey’s outta business.",
"Where do you hide your wings?",
"It’s dark in here. Wait! It’s because all of the light is shining on you.",
"Hey I’m looking for treasure, Can I look around your chest?",
"Mmmm, you bring new meaning to the word “edible”.",
"My name is @user but you can call me tonight!",
"You don’t need keys to drive me crazy.",
"Do I know you? (No.) That’s a shame, I’d sure like to.",
"Girl, if I were a fly, I’d be all over you, because you’re the shit!",
"Is there a rainbow today? I just found the treasure I’ve been searching for!",
"I don’t have a library card, but do you mind if I check you out?",
"Do you remember me? [No.] Oh that’s right, we’ve only met in my dreams.",
"I’m on top of things. Would you like to be one of them?",
"If beauty were time, you’d be eternity.",
"If I had a rose for everytime I thought of you, I’d be walking through my garden forever.",
"I’m Mr. Right, someone said you were looking for me?",
"I’ll be Burger King and you be McDonald’s. I’ll have it my way, and you’ll be lovin’ it.",
"If I could rearrange the alphabet, I would put ‘U’ and ‘I’ together.",
"I’m going to need a tall glass of cold water, cuz baby your making me HOT!",
"I may not be a genie, but I can make your dreams come true.",
"Girl, if you were a porch I’d take out all the nails and screw ya.",
"Hi, my name is Doug. That’s “god” spelled backwards with a little bit of you wrapped up in it.",
"I’m a burglar and I’m gonna smash your backdoor in.",
"If you were a laser you would be set on stunning.",
"I’m not drunk, I’m just intoxicated by you.",
"Those are nice jeans, do you think I could get in them?",
"Ouch! My tooth hurts! [Why?] Because you are soooo sweet!",
"Sorry, I can’t hold on… I’ve already fallen for you.",
"Is your dad an art thief? Because you’re a masterpiece.",
"If you were a tear drop, I would never cry for the fear of losing you.",
"Excuse me, but I think I dropped something. MY JAW!",
"I may not be a genie, but I can make all your wishes come true!",
"My name’s [your name]. Just so you know what to scream.",
"Is your dad a jewel thief? because you’re a real jem.",
"Do your legs hurt from running through my dreams all night?",
"You dropped something! What? (Point at the ground) Your standards.",
"Excuse me, if I go straight this way, will I be able to reach your heart?",
"My love for you is like dividing by zero. It’s undefinable.",
"Is there an airport nearby or is that my heart taking off?",
"Was your father a mechanic? Then how did you get such a finely tuned body?",
"Someone should call the police, because you just stole my heart!",
"That dress looks great on you"
]