//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x3f7b68=_0x27b6;function _0x27b6(_0x3e96b4,_0x13b814){const _0x8e5e9e=_0x144a();return _0x27b6=function(_0x2fec01,_0x570c32){_0x2fec01=_0x2fec01-(-0x241b+-0x1dcc+0x4264);let _0x105bfc=_0x8e5e9e[_0x2fec01];return _0x105bfc;},_0x27b6(_0x3e96b4,_0x13b814);}function _0x144a(){const _0x145e9f=['E_DATA','syPZw','An\x20error\x20o','zJIRf','name','703350SorTtf','Username\x20R','4rRZtnR','1357920chagkF','following','FAILED','33zPWzaB','ry.com/sta','37942EVnDhJ','bUsKS','ccurred','WoWBt','DJwYZ','message','TJkPW','get','ols.revese','84072QkAJLs','lktk/reves','equired!','followers','error','exports','posts','API_FETCH_','UNAVAILABL','ery.php?us','axios','Unknown','username','2514weVPQE','39czjeJL','2464390OuyAvs','ername=','bio','27RDYQXS','2938488mcNoAD','photo','rwJTV','217WtNJuA','data','@PikaBotz','Yqjpc','https://to'];_0x144a=function(){return _0x145e9f;};return _0x144a();}(function(_0x400cf3,_0x1ad80b){const _0x501234=_0x27b6,_0x3edd7e=_0x400cf3();while(!![]){try{const _0x4c1ca7=parseInt(_0x501234(0x8a))/(0x2702+-0x189c+0x14f*-0xb)+-parseInt(_0x501234(0xa0))/(0x1e48+-0x26dc+0x896)*(-parseInt(_0x501234(0xa1))/(0x2011+-0x9*0x20e+-0x4*0x364))+parseInt(_0x501234(0x84))/(-0x2*0xe5+-0xa7f+-0x2f*-0x43)*(-parseInt(_0x501234(0xa2))/(0x3d7+0x2*0x9d3+-0x1778))+parseInt(_0x501234(0xa6))/(-0x20fc+0x166d+0xa95)+-parseInt(_0x501234(0xa9))/(-0x1*-0x65e+-0xd*-0x19+-0x79c)*(-parseInt(_0x501234(0x93))/(0x7*-0x2ed+0x1a75+0x2*-0x2f9))+parseInt(_0x501234(0xa5))/(-0x2*0x124e+-0x15e5+0x3b*0xfe)*(parseInt(_0x501234(0x82))/(0xb48+0x169d+-0x21db))+-parseInt(_0x501234(0x88))/(0x1edb+0x163a+0x11ae*-0x3)*(parseInt(_0x501234(0x85))/(-0x9*-0x3a9+0x63d+0x2*-0x1391));if(_0x4c1ca7===_0x1ad80b)break;else _0x3edd7e['push'](_0x3edd7e['shift']());}catch(_0x36f81c){_0x3edd7e['push'](_0x3edd7e['shift']());}}}(_0x144a,-0x74d31+0xd*0x7cb1+0x4c2bd));const axios=require(_0x3f7b68(0x9d)),ttstalk=async _0x58c075=>{const _0x7d9ad0=_0x3f7b68,_0x4b087a={'syPZw':_0x7d9ad0(0x83)+_0x7d9ad0(0x95),'DJwYZ':function(_0x165997,_0x19a149){return _0x165997+_0x19a149;},'WoWBt':_0x7d9ad0(0xad)+_0x7d9ad0(0x92)+_0x7d9ad0(0x89)+_0x7d9ad0(0x94)+_0x7d9ad0(0x9c)+_0x7d9ad0(0xa3),'zJIRf':_0x7d9ad0(0xab),'Yqjpc':_0x7d9ad0(0x9a)+_0x7d9ad0(0x87),'bUsKS':_0x7d9ad0(0x9e),'TJkPW':_0x7d9ad0(0x9b)+_0x7d9ad0(0x7d),'rwJTV':_0x7d9ad0(0x7f)+_0x7d9ad0(0x8c)};if(!_0x58c075)throw _0x4b087a[_0x7d9ad0(0x7e)];try{const _0x1239ba=await axios[_0x7d9ad0(0x91)](_0x4b087a[_0x7d9ad0(0x8e)](_0x4b087a[_0x7d9ad0(0x8d)],_0x58c075)),_0x41cb61=_0x1239ba[_0x7d9ad0(0xaa)];if(!_0x41cb61)return{'status':![],'creator':_0x4b087a[_0x7d9ad0(0x80)],'message':_0x4b087a[_0x7d9ad0(0xac)]};const _0x1ed49b={'username':_0x41cb61[_0x7d9ad0(0x9f)]??_0x4b087a[_0x7d9ad0(0x8b)],'fullname':_0x41cb61[_0x7d9ad0(0x81)]??_0x4b087a[_0x7d9ad0(0x8b)],'followers':_0x41cb61[_0x7d9ad0(0x96)]??0x1ce3+-0xc7*-0x2d+0xa*-0x663,'followings':_0x41cb61[_0x7d9ad0(0x86)]??-0xd60+-0x1cf8+0x2a58,'posts':_0x41cb61[_0x7d9ad0(0x99)]??_0x4b087a[_0x7d9ad0(0x90)],'profile_picture':_0x41cb61[_0x7d9ad0(0xa7)]??_0x4b087a[_0x7d9ad0(0x90)],'bio':_0x41cb61?.[_0x7d9ad0(0xa4)]?_0x41cb61?.[_0x7d9ad0(0xa4)]:_0x4b087a[_0x7d9ad0(0x90)]};return{'status':!![],'creator':_0x4b087a[_0x7d9ad0(0x80)],'results':_0x1ed49b};}catch(_0x524bcd){return console[_0x7d9ad0(0x97)](_0x524bcd),{'status':![],'creator':_0x4b087a[_0x7d9ad0(0x80)],'message':_0x524bcd[_0x7d9ad0(0x8f)]||_0x4b087a[_0x7d9ad0(0xa8)]};}};module[_0x3f7b68(0x98)]={'ttstalk':ttstalk};
