//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x5ace59=_0x37bd;(function(_0x1a167a,_0x529889){const _0x5d3da2=_0x37bd,_0x4e6b0a=_0x1a167a();while(!![]){try{const _0x539501=parseInt(_0x5d3da2(0x1fd))/(-0x7f8+0x1*0x21aa+-0x19b1)+parseInt(_0x5d3da2(0x202))/(-0x11*-0x6d+0x9*0x125+-0x1188*0x1)+parseInt(_0x5d3da2(0x200))/(0x1181*0x1+-0x857+-0x927)*(parseInt(_0x5d3da2(0x1fe))/(0x53*-0x4f+0x144f+0xe3*0x6))+-parseInt(_0x5d3da2(0x1e3))/(-0xd13*0x1+0x1*-0x23c5+0x1*0x30dd)*(-parseInt(_0x5d3da2(0x1f8))/(0x95*-0x4+0x25*0xe5+0x11*-0x1cf))+-parseInt(_0x5d3da2(0x1e7))/(0x112*0xa+-0x252b+0x1*0x1a7e)+parseInt(_0x5d3da2(0x1f2))/(0x1653+0xe0c+0x531*-0x7)+-parseInt(_0x5d3da2(0x20c))/(0x7*0x182+-0x199*0x13+-0x9eb*-0x2);if(_0x539501===_0x529889)break;else _0x4e6b0a['push'](_0x4e6b0a['shift']());}catch(_0x2863a7){_0x4e6b0a['push'](_0x4e6b0a['shift']());}}}(_0x1278,-0x2e43e+-0x5644*0x6+0x6c8c2));function _0x1278(){const _0x5220b1=['189260vktvWQ','hnMUZ','https://to','tDJgP','815213RXCpWm','following','posts','FtdFT','ols.revese','username','knMzU','axios','Username\x20R','bio','ery.php?us','1789512xjLbhw','UNAVAILABL','equired!','lktk/reves','gSGPV','bVHIy','12htqrXq','get','ccurred','E_DATA','ry.com/sta','122056gZWuBi','1756tBYydo','data','219avKytC','name','404904jbTwsK','message','FAILED','@PikaBotz','API_FETCH_','error','ername=','followers','TUHab','exports','3751965yzrTmA','photo','An\x20error\x20o'];_0x1278=function(){return _0x5220b1;};return _0x1278();}const axios=require(_0x5ace59(0x1ee)),ttstalk=async _0x2ef5a9=>{const _0x3a44b7=_0x5ace59,_0x6f6937={'FtdFT':_0x3a44b7(0x1ef)+_0x3a44b7(0x1f4),'hnMUZ':function(_0x23140e,_0x2581f9){return _0x23140e+_0x2581f9;},'TUHab':_0x3a44b7(0x1e5)+_0x3a44b7(0x1eb)+_0x3a44b7(0x1fc)+_0x3a44b7(0x1f5)+_0x3a44b7(0x1f1)+_0x3a44b7(0x208),'bVHIy':_0x3a44b7(0x205),'knMzU':_0x3a44b7(0x206)+_0x3a44b7(0x204),'tDJgP':_0x3a44b7(0x1f3)+_0x3a44b7(0x1fb),'gSGPV':_0x3a44b7(0x1e2)+_0x3a44b7(0x1fa)};if(!_0x2ef5a9)throw _0x6f6937[_0x3a44b7(0x1ea)];try{const _0x1c98a5=await axios[_0x3a44b7(0x1f9)](_0x6f6937[_0x3a44b7(0x1e4)](_0x6f6937[_0x3a44b7(0x20a)],_0x2ef5a9)),_0x2b1bd6=_0x1c98a5[_0x3a44b7(0x1ff)];if(!_0x2b1bd6)return{'status':![],'creator':_0x6f6937[_0x3a44b7(0x1f7)],'message':_0x6f6937[_0x3a44b7(0x1ed)]};const _0x38acae={'username':_0x2b1bd6[_0x3a44b7(0x1ec)]??_0x6f6937[_0x3a44b7(0x1e6)],'fullname':_0x2b1bd6[_0x3a44b7(0x201)]??_0x6f6937[_0x3a44b7(0x1e6)],'followers':_0x2b1bd6[_0x3a44b7(0x209)]??_0x6f6937[_0x3a44b7(0x1e6)],'followings':_0x2b1bd6[_0x3a44b7(0x1e8)]??_0x6f6937[_0x3a44b7(0x1e6)],'posts':_0x2b1bd6[_0x3a44b7(0x1e9)]??_0x6f6937[_0x3a44b7(0x1e6)],'profile_pic':_0x2b1bd6[_0x3a44b7(0x20d)]??_0x6f6937[_0x3a44b7(0x1e6)],'bio':_0x2b1bd6?.[_0x3a44b7(0x1f0)]?_0x2b1bd6?.[_0x3a44b7(0x1f0)]:_0x6f6937[_0x3a44b7(0x1e6)]};return{'status':!![],'creator':_0x6f6937[_0x3a44b7(0x1f7)],'results':_0x38acae};}catch(_0x91876f){return console[_0x3a44b7(0x207)](_0x91876f),{'status':![],'creator':_0x6f6937[_0x3a44b7(0x1f7)],'message':_0x91876f[_0x3a44b7(0x203)]||_0x6f6937[_0x3a44b7(0x1f6)]};}};function _0x37bd(_0x3af2f1,_0x380107){const _0x2a906d=_0x1278();return _0x37bd=function(_0x55370a,_0x252fc9){_0x55370a=_0x55370a-(0x1e12+0x4*0x5dc+-0x33a0);let _0x2d5997=_0x2a906d[_0x55370a];return _0x2d5997;},_0x37bd(_0x3af2f1,_0x380107);}module[_0x5ace59(0x20b)]={'ttstalk':ttstalk};
