//      ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗
//      ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║
//      ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║
//      ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║
//      ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║
//      ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝

//      ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░
//      ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗
//      ███████║██╔██╗██║░╚████╔╝░███████║
//      ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║
//      ██║░░██║██║░╚███║░░░██║░░░██║░░██║
//      ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝

//      ██╗░░░██╗███████╗██████╗░░░░██████╗░
//      ██║░░░██║██╔════╝██╔══██╗░░░╚════██╗
//      ╚██╗░██╔╝█████╗░░██████╔╝░░░░░███╔═╝
//      ░╚████╔╝░██╔══╝░░██╔══██╗░░░██╔══╝░░
//      ░░╚██╔╝░░███████╗██║░░██║██╗███████╗
//      ░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═╝╚══════╝


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x5b9669=_0x10eb;(function(_0x1d5e11,_0x54f29d){const _0x5059bf=_0x10eb,_0x294ee9=_0x1d5e11();while(!![]){try{const _0x28ca03=-parseInt(_0x5059bf(0x110))/(0x1b3e+-0x9b9+0x1*-0x1184)*(-parseInt(_0x5059bf(0xfe))/(0x20b8+0x2363+0x9*-0x791))+parseInt(_0x5059bf(0x124))/(-0x65*0x41+-0x2637+-0x53*-0xc5)+-parseInt(_0x5059bf(0xe8))/(0x1038+0x1ea7+-0x95f*0x5)+parseInt(_0x5059bf(0x100))/(0x1*0x1adf+-0x1f3a+-0x5*-0xe0)+parseInt(_0x5059bf(0x132))/(0x2170+0x113e+-0x32a8)*(-parseInt(_0x5059bf(0x112))/(-0x2185+0x537+0x1*0x1c55))+-parseInt(_0x5059bf(0x11a))/(0x193f+0x2170+-0x3aa7)+parseInt(_0x5059bf(0x12f))/(0x137+-0x225e+-0x84c*-0x4);if(_0x28ca03===_0x54f29d)break;else _0x294ee9['push'](_0x294ee9['shift']());}catch(_0x2cac6d){_0x294ee9['push'](_0x294ee9['shift']());}}}(_0x20c1,-0xbaa69+0x6eaf5+-0x10*-0xaa26));function _0x20c1(){const _0x5e8760=['09f-70c7ac','4.0.0.0\x20Sa','8GLnRRkvAo','715dc1','POST','Win64;\x20x64','ate,\x20br,\x20z','applicatio','48LIEXtC','path','1954595PMxCCT','-api.magic','Error\x20fetc','a584e30d-1','0\x20(Windows','sponse\x20was','fari/537.3','VXNSs','0.0.0','https://ai','pSgX7Wgjuk','en-US,en;q','-generator','\x20Chrome/12','wyXCn','dJtpe','5426xtRcwM','\x20not\x20ok','3130743Weypwv','aiArtGener','Mozilla/5.','t-generato','=0.9','gicstudio.','Network\x20re','PvEJX','5185184JCdAlE','XBclm','LCVug','Jlqa5eAVvj','hing\x20data:','now','xt/plain,\x20','XCBoYwDM8G','996-4598-9','OVMBh','1293192ywZdVb','FEvjN','*/*','com/ai-art','\x20NT\x2010.0;\x20','null','\x20(KHTML,\x20l','lQmym','error','gzip,\x20defl','oFPeP','11658105tSuoEV','n/json,\x20te','https://ma','6XmpwNm','false','kwPwG','arrayBuffe',')\x20AppleWeb','CNLAr','/api/ai-ar','3065532MCKdUj','YnIFC','ike\x20Gecko)','std','qEngZ','com','eAJil','6\x20Edg/124.','bytes','studio.com','Kit/537.36','owBFv','95o','ator'];_0x20c1=function(){return _0x5e8760;};return _0x20c1();}const fs=require('fs'),path=require(_0x5b9669(0xff));function _0x10eb(_0x434e48,_0x33a74f){const _0x5bb776=_0x20c1();return _0x10eb=function(_0x1a37b3,_0x399c77){_0x1a37b3=_0x1a37b3-(0x14b6+-0x43+-0x1390);let _0x528050=_0x5bb776[_0x1a37b3];return _0x528050;},_0x10eb(_0x434e48,_0x33a74f);}exports[_0x5b9669(0x113)+_0x5b9669(0xf5)]=async _0x308a63=>{const _0x2a1d5b=_0x5b9669,_0x463bfc={'eAJil':function(_0x31e819,_0x22ec7c,_0x4efbd5){return _0x31e819(_0x22ec7c,_0x4efbd5);},'FEvjN':_0x2a1d5b(0x109)+_0x2a1d5b(0x101)+_0x2a1d5b(0xf1)+_0x2a1d5b(0xe7)+_0x2a1d5b(0x115)+'r','VXNSs':_0x2a1d5b(0xfa),'dJtpe':_0x2a1d5b(0x114)+_0x2a1d5b(0x104)+_0x2a1d5b(0x128)+_0x2a1d5b(0xfb)+_0x2a1d5b(0xe5)+_0x2a1d5b(0xf2)+_0x2a1d5b(0x12a)+_0x2a1d5b(0xea)+_0x2a1d5b(0x10d)+_0x2a1d5b(0xf7)+_0x2a1d5b(0x106)+_0x2a1d5b(0xef)+_0x2a1d5b(0x108),'OVMBh':_0x2a1d5b(0xfd)+_0x2a1d5b(0x130)+_0x2a1d5b(0x120)+_0x2a1d5b(0x126),'CNLAr':_0x2a1d5b(0x12d)+_0x2a1d5b(0xfc)+_0x2a1d5b(0xeb),'LCVug':_0x2a1d5b(0x10b)+_0x2a1d5b(0x116),'wyXCn':_0x2a1d5b(0x131)+_0x2a1d5b(0x117)+_0x2a1d5b(0xed),'lQmym':_0x2a1d5b(0x131)+_0x2a1d5b(0x117)+_0x2a1d5b(0x127)+_0x2a1d5b(0x10c)+'/','owBFv':_0x2a1d5b(0xf0),'YnIFC':_0x2a1d5b(0x129),'qEngZ':_0x2a1d5b(0x103)+_0x2a1d5b(0x122)+_0x2a1d5b(0xf6)+_0x2a1d5b(0xf9),'PvEJX':_0x2a1d5b(0x133),'kwPwG':_0x2a1d5b(0x10a)+_0x2a1d5b(0x121)+_0x2a1d5b(0xf8)+_0x2a1d5b(0x11d)+_0x2a1d5b(0xf4),'oFPeP':_0x2a1d5b(0x118)+_0x2a1d5b(0x105)+_0x2a1d5b(0x111),'XBclm':_0x2a1d5b(0x102)+_0x2a1d5b(0x11e)};try{const _0x2f22eb=await _0x463bfc[_0x2a1d5b(0xee)](fetch,_0x463bfc[_0x2a1d5b(0x125)],{'method':_0x463bfc[_0x2a1d5b(0x107)],'headers':{'User-Agent':_0x463bfc[_0x2a1d5b(0x10f)],'Accept':_0x463bfc[_0x2a1d5b(0x123)],'Accept-Encoding':_0x463bfc[_0x2a1d5b(0xe6)],'Accept-Language':_0x463bfc[_0x2a1d5b(0x11c)],'Origin':_0x463bfc[_0x2a1d5b(0x10e)],'Referer':_0x463bfc[_0x2a1d5b(0x12b)]},'body':new URLSearchParams({'prompt':_0x308a63,'output_format':_0x463bfc[_0x2a1d5b(0xf3)],'user_profile_id':_0x463bfc[_0x2a1d5b(0xe9)],'anonymous_user_id':_0x463bfc[_0x2a1d5b(0xec)],'request_timestamp':Date[_0x2a1d5b(0x11f)](),'user_is_subscribed':_0x463bfc[_0x2a1d5b(0x119)],'client_id':_0x463bfc[_0x2a1d5b(0xe3)]})});if(!_0x2f22eb['ok'])throw new Error(_0x463bfc[_0x2a1d5b(0x12e)]);const _0x50ad96=await _0x2f22eb[_0x2a1d5b(0xe4)+'r']();return _0x50ad96;}catch(_0x1e1126){console[_0x2a1d5b(0x12c)](_0x463bfc[_0x2a1d5b(0x11b)],_0x1e1126);throw _0x1e1126;}};
