//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


function _0x3278(_0x1c325d,_0x283057){const _0x5673eb=_0x2196();return _0x3278=function(_0x18bd7b,_0x3a8b62){_0x18bd7b=_0x18bd7b-(0x4b7+0x61*0x4f+-0xe*0x26e);let _0x53c0bb=_0x5673eb[_0x18bd7b];return _0x53c0bb;},_0x3278(_0x1c325d,_0x283057);}function _0x2196(){const _0xdc86f2=['w.blackbox','exports','data','441aHdiIB','118CgSIMe','.ai/api/ch','1140nHxjub','2513984BuwSQx','135399LMkwus','user','fUjvp','error','https://ww','42144gAixcH','OcTCj','8812PIvdDP','789jBkZbe','post','10762OHuopT','2011280UEWTuB','axios','message','5490378bvlBpe'];_0x2196=function(){return _0xdc86f2;};return _0x2196();}const _0x55c110=_0x3278;(function(_0x454a17,_0x2b8b31){const _0x41500a=_0x3278,_0x3b5259=_0x454a17();while(!![]){try{const _0x406976=-parseInt(_0x41500a(0xb0))/(-0x14d3*-0x1+-0x1ad7+0x605)*(-parseInt(_0x41500a(0xa7))/(-0xd5d*-0x2+-0x2668+0xbb0))+parseInt(_0x41500a(0xa5))/(-0x4cd*0x4+-0x16b0+-0x1*-0x29e7)*(-parseInt(_0x41500a(0xa4))/(-0x331*-0x3+-0x460+-0x52f))+-parseInt(_0x41500a(0xa8))/(-0x203a+-0x4a*-0x79+0x1*-0x2bb)+parseInt(_0x41500a(0xa2))/(-0x1a90+-0x1*-0x207+0x188f)*(-parseInt(_0x41500a(0xaf))/(-0x17fb+-0x21f7+0x11*0x369))+parseInt(_0x41500a(0xb3))/(-0x31a+-0x8f9*-0x2+-0xed0)+-parseInt(_0x41500a(0xab))/(0x12dd+-0x6*-0x3e9+-0x2a4a*0x1)+-parseInt(_0x41500a(0xb2))/(-0x23c+-0x1fd1+0x2217)*(-parseInt(_0x41500a(0xb4))/(-0x6d*0x39+-0xed*-0xf+0x9d*0x11));if(_0x406976===_0x2b8b31)break;else _0x3b5259['push'](_0x3b5259['shift']());}catch(_0x14d41c){_0x3b5259['push'](_0x3b5259['shift']());}}}(_0x2196,-0x60ff0+-0x6baa6+0x11a5af));const axios=require(_0x55c110(0xa9)),blackbox=async(_0x5a9512,_0x1dc0a1,_0x59bc13=![])=>{const _0x32533f=_0x55c110,_0x5c288a={'OcTCj':_0x32533f(0xb5),'fUjvp':_0x32533f(0xb8)+_0x32533f(0xac)+_0x32533f(0xb1)+'at'};try{const _0x4bd0c7={'messages':[{'content':_0x1dc0a1,'role':_0x5c288a[_0x32533f(0xa3)]}],'previewToken':null,'codeModelMode':!![],'agentMode':{},'trendingAgentMode':{},'isMicMode':![],'isChromeExt':![],'githubToken':null,'webSearchMode':_0x59bc13},_0x34b5ed=_0x5c288a[_0x32533f(0xb6)],_0x539c9b=await axios[_0x32533f(0xa6)](_0x34b5ed,_0x4bd0c7);return{'status':!![],'message':_0x539c9b[_0x32533f(0xae)]};}catch(_0x1788d6){return console[_0x32533f(0xb7)](_0x1788d6),{'status':![],'message':_0x1788d6[_0x32533f(0xaa)]};}};module[_0x55c110(0xad)]={'blackbox':blackbox};
