//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


function _0x3afd(_0x5d46ce,_0xe5f913){const _0x4332a8=_0x56ea();return _0x3afd=function(_0x49441f,_0x194de3){_0x49441f=_0x49441f-(0x3*-0xa94+-0x1*-0x15bd+0xb75);let _0x52212c=_0x4332a8[_0x49441f];return _0x52212c;},_0x3afd(_0x5d46ce,_0xe5f913);}const _0x314125=_0x3afd;function _0x56ea(){const _0x4d8a23=['2005470rctxKn','$@$v=undef','8883280jfgabg','data','w.blackbox','exports','ined-rv1$@','2201801BubxlS','wanPt','message','rYuSV','1949160VWoILj','vDHPV','post','20924703pVdgBT','711785wLvxKl','6JNoxrj','6GLwyXD','3871015mghtGX','user','replace','.ai/api/ch','https://ww','error','axios'];_0x56ea=function(){return _0x4d8a23;};return _0x56ea();}(function(_0x537469,_0x532c36){const _0x578b5e=_0x3afd,_0x33c9c1=_0x537469();while(!![]){try{const _0x1e3932=parseInt(_0x578b5e(0x188))/(0x1c66+-0xd46+-0xf1f)+-parseInt(_0x578b5e(0x179))/(0xa0a+-0x543+-0x4c5)+-parseInt(_0x578b5e(0x18a))/(0x1*0x1d0b+-0xb9a*-0x3+-0x3fd6)*(-parseInt(_0x578b5e(0x184))/(-0x1136*0x2+-0x1*0x6e3+-0x1*-0x2953))+-parseInt(_0x578b5e(0x18b))/(-0x1c55+0x1864+0x3f6)+parseInt(_0x578b5e(0x189))/(-0x1*0x26ff+-0xc6d*-0x2+0xe2b)*(-parseInt(_0x578b5e(0x180))/(-0x253a+0x1*0x1f91+-0x5b*-0x10))+-parseInt(_0x578b5e(0x17b))/(0x1a3*0x13+0x1*-0x782+-0x178f)+parseInt(_0x578b5e(0x187))/(-0x991+-0xd*-0xdd+-0x19f);if(_0x1e3932===_0x532c36)break;else _0x33c9c1['push'](_0x33c9c1['shift']());}catch(_0x59fa7e){_0x33c9c1['push'](_0x33c9c1['shift']());}}}(_0x56ea,-0xea118+0x5*-0x46d3b+0x311d20));const axios=require(_0x314125(0x178)),blackbox=async(_0x5d946d,_0x4f70e4,_0x4fff37=![])=>{const _0x578406=_0x314125,_0x6b803a={'rYuSV':_0x578406(0x18c),'vDHPV':_0x578406(0x176)+_0x578406(0x17d)+_0x578406(0x18e)+'at','wanPt':_0x578406(0x17a)+_0x578406(0x17f)+'$'};try{const _0x45ff5b={'messages':[{'content':_0x4f70e4,'role':_0x6b803a[_0x578406(0x183)]}],'previewToken':null,'codeModelMode':!![],'agentMode':{},'trendingAgentMode':{},'isMicMode':![],'isChromeExt':![],'githubToken':null,'webSearchMode':_0x4fff37},_0x4c4cda=_0x6b803a[_0x578406(0x185)],_0x1a28dd=await axios[_0x578406(0x186)](_0x4c4cda,_0x45ff5b);return{'status':!![],'message':_0x1a28dd[_0x578406(0x17c)][_0x578406(0x18d)](_0x6b803a[_0x578406(0x181)],'')};}catch(_0x4525c1){return console[_0x578406(0x177)](_0x4525c1),{'status':![],'message':_0x4525c1[_0x578406(0x182)]};}};module[_0x314125(0x17e)]={'blackbox':blackbox};
