//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x52f381=_0x40f9;(function(_0xa439d5,_0x1702be){const _0x2edf94=_0x40f9,_0x31b8d9=_0xa439d5();while(!![]){try{const _0x3d806d=-parseInt(_0x2edf94(0x1a1))/(0xf1f+0x10ee+-0x200c)+parseInt(_0x2edf94(0x1a7))/(0x125b+0x7c*-0x29+-0x9*-0x2b)*(parseInt(_0x2edf94(0x1aa))/(0x10eb+0x20e2+0x2*-0x18e5))+-parseInt(_0x2edf94(0x1a4))/(0x1717*0x1+0x178d+-0x1*0x2ea0)*(-parseInt(_0x2edf94(0x1b5))/(-0x1b95+-0x4*-0x6a7+0x2*0x7f))+-parseInt(_0x2edf94(0x1a6))/(0xa99+-0x19*0xb+-0x980)*(parseInt(_0x2edf94(0x1ad))/(-0x1bc+-0x2342*-0x1+-0x217f))+-parseInt(_0x2edf94(0x1a2))/(0x403+0x4*0xd5+-0x74f)+-parseInt(_0x2edf94(0x1b1))/(-0x878*0x4+-0x7*-0x546+-0x1*0x301)*(-parseInt(_0x2edf94(0x1b9))/(0x1c9e+0xf1a+-0x2bae))+parseInt(_0x2edf94(0x1ba))/(-0x17*0x192+-0x2413+0x241e*0x2)*(parseInt(_0x2edf94(0x1b6))/(-0x51b*0x1+0x1c18+-0x16f1*0x1));if(_0x3d806d===_0x1702be)break;else _0x31b8d9['push'](_0x31b8d9['shift']());}catch(_0x487f2c){_0x31b8d9['push'](_0x31b8d9['shift']());}}}(_0x4bf1,0x48eec+-0x43a*0x199+0x27*0x4d91));function _0x40f9(_0x45e639,_0x4a12be){const _0x2d5c6b=_0x4bf1();return _0x40f9=function(_0x2bb07f,_0x51b3ae){_0x2bb07f=_0x2bb07f-(0x2f*-0x62+0x1e0f+0x1*-0xa71);let _0x4f1e43=_0x2d5c6b[_0x2bb07f];return _0x4f1e43;},_0x40f9(_0x45e639,_0x4a12be);}const axios=require(_0x52f381(0x1ab)),blackbox=async(_0x445d3e,_0xd392b4,_0x18bc43=![])=>{const _0x1a2029=_0x52f381,_0x94cdbd={'CGRBa':_0x1a2029(0x1a8),'ZBnwC':_0x1a2029(0x1a9)+_0x1a2029(0x1a5)+_0x1a2029(0x1b2)+'at','nPMtB':_0x1a2029(0x1b0)+_0x1a2029(0x1a3)};try{const _0x19eccc={'messages':[{'content':_0xd392b4,'role':_0x94cdbd[_0x1a2029(0x1af)]}],'previewToken':null,'codeModelMode':!![],'agentMode':{},'trendingAgentMode':{},'isMicMode':![],'isChromeExt':![],'githubToken':null,'webSearchMode':_0x18bc43},_0x34d86c=_0x94cdbd[_0x1a2029(0x1bb)],_0x390d3f=await axios[_0x1a2029(0x1b8)](_0x34d86c,_0x19eccc);return{'status':!![],'message':_0x390d3f[_0x1a2029(0x1b3)][_0x1a2029(0x1b7)](_0x94cdbd[_0x1a2029(0x1b4)],'')};}catch(_0x1d5d5a){return console[_0x1a2029(0x1a0)](_0x1d5d5a),{'status':![],'message':_0x1d5d5a[_0x1a2029(0x1ac)]};}};function _0x4bf1(){const _0x51425b=['1113344GLtgcg','w.blackbox','530688fXzETx','60886awehxz','user','https://ww','57ykrhyn','axios','message','84QdvLYD','exports','CGRBa','$@$v=undef','9133083szpfpk','.ai/api/ch','data','nPMtB','5uBiDKQ','24NxPhMy','replace','post','10PSoFKV','4822697BPgWDh','ZBnwC','error','935032FQerik','970952ZBRpbT','ined-rv1$@'];_0x4bf1=function(){return _0x51425b;};return _0x4bf1();}module[_0x52f381(0x1ae)]={'blackbox':blackbox};
