//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x5ccab9=_0xf683;(function(_0x578f91,_0x35bdfc){const _0x516c1e=_0xf683,_0x41e40e=_0x578f91();while(!![]){try{const _0x5f12c0=-parseInt(_0x516c1e(0x192))/(0x103f+0x19a4+-0x14f1*0x2)*(parseInt(_0x516c1e(0x19b))/(0x1dff+-0x95*0x2+0x2f*-0x9d))+parseInt(_0x516c1e(0x195))/(-0x3b*0x66+-0x83*-0x1d+0xb*0xca)+parseInt(_0x516c1e(0x199))/(-0x26f4+-0x1*-0x3e+0x26ba)+parseInt(_0x516c1e(0x18d))/(-0x1011+0x13bc+-0x3a6)+-parseInt(_0x516c1e(0x190))/(0x9*-0x359+-0x14*0x3+-0x1e63*-0x1)+parseInt(_0x516c1e(0x19f))/(0x1*0x20f+-0x569*-0x4+-0x6*0x3f2)+-parseInt(_0x516c1e(0x19d))/(0x1*-0x195a+0x167f+-0x2e3*-0x1)*(parseInt(_0x516c1e(0x18b))/(0x11*-0x119+0x1c61*0x1+-0x9af));if(_0x5f12c0===_0x35bdfc)break;else _0x41e40e['push'](_0x41e40e['shift']());}catch(_0x48506b){_0x41e40e['push'](_0x41e40e['shift']());}}}(_0x54ef,0x5*-0x7295+0x32c05+0xb*0x7133));function _0xf683(_0x32e6df,_0x2ae515){const _0x2b7424=_0x54ef();return _0xf683=function(_0x466435,_0x493f0c){_0x466435=_0x466435-(-0x14e*-0x3+-0x666+0x406);let _0x3287a1=_0x2b7424[_0x466435];return _0x3287a1;},_0xf683(_0x32e6df,_0x2ae515);}function _0x54ef(){const _0x45c673=['634445ZoRARB','ZLnIa','oyeb.app/','&turnid=','get','189iNhaaC','sage=','3647740fAaNlX','https://ai','then','2879166PWmvtQ','@PikaBotz','3620zQDOUT','anya','exports','2124246crfLSI','message','axios','anyaai?mes','1673504omMtBz','-features-','196oeruvu','pikabotz.k','278872Xnvwpz','oTpXt'];_0x54ef=function(){return _0x45c673;};return _0x54ef();}const axios=require(_0x5ccab9(0x197)),baseUrl=_0x5ccab9(0x18e)+_0x5ccab9(0x19a)+_0x5ccab9(0x19c)+_0x5ccab9(0x1a1),cai=async(_0x3e3026,_0x44a18d,_0x1cf4a4=_0x5ccab9(0x193))=>{const _0x22dd3b=_0x5ccab9,_0x4057c9={'ZLnIa':function(_0x37a253,_0x2d5b9d){return _0x37a253(_0x2d5b9d);},'oTpXt':_0x22dd3b(0x191)};try{return await axios[_0x22dd3b(0x18a)](baseUrl+(_0x22dd3b(0x198)+_0x22dd3b(0x18c))+_0x4057c9[_0x22dd3b(0x1a0)](encodeURIComponent,_0x44a18d)+_0x22dd3b(0x1a2)+_0x3e3026)[_0x22dd3b(0x18f)](({data:_0x3cdd2c})=>_0x3cdd2c);}catch(_0x505d37){return{'status':![],'creator':_0x4057c9[_0x22dd3b(0x19e)],'message':_0x505d37[_0x22dd3b(0x196)]};}};module[_0x5ccab9(0x194)]={'cai':cai};
