//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


function _0x18b6(_0x31c1d1,_0x35e421){const _0x3bbee1=_0x4794();return _0x18b6=function(_0x4441b4,_0x274dc1){_0x4441b4=_0x4441b4-(-0x2*-0xe4b+0x849+-0x2404);let _0x50cce2=_0x3bbee1[_0x4441b4];return _0x50cce2;},_0x18b6(_0x31c1d1,_0x35e421);}const _0x1f0d87=_0x18b6;(function(_0x32d30c,_0x152cef){const _0x11cd66=_0x18b6,_0x25f5ba=_0x32d30c();while(!![]){try{const _0x48f817=parseInt(_0x11cd66(0xe9))/(-0x1428+-0xb8*-0x1b+0x1*0xc1)+parseInt(_0x11cd66(0xf7))/(-0x153b*0x1+0x30*0x1d+0xfcd)*(parseInt(_0x11cd66(0xdd))/(0x2702+0x18*-0x17+-0x24d7))+-parseInt(_0x11cd66(0xe7))/(-0x48a*-0x2+0x40d+-0x45f*0x3)+parseInt(_0x11cd66(0xdb))/(0x14*0x19c+-0x1d91+-0x29a)*(parseInt(_0x11cd66(0xf0))/(-0x1*0x1d21+0x2392+-0x1*0x66b))+-parseInt(_0x11cd66(0xee))/(0x1a21*-0x1+-0xd*0x6e+0x1fbe)+parseInt(_0x11cd66(0xea))/(0x1883+-0x15a8+0x1*-0x2d3)+-parseInt(_0x11cd66(0xef))/(0x3*-0x4b5+-0x778*-0x4+-0xfb8);if(_0x48f817===_0x152cef)break;else _0x25f5ba['push'](_0x25f5ba['shift']());}catch(_0x3ea983){_0x25f5ba['push'](_0x25f5ba['shift']());}}}(_0x4794,-0x10f34e+0x17dc28+0x74f87));const axios=require(_0x1f0d87(0xf3)),baseUrl=_0x1f0d87(0xf1)+_0x1f0d87(0xdf)+_0x1f0d87(0xe3)+_0x1f0d87(0xe0),cai=async(_0x347fa3,_0x2d6ba2,_0x792c82=_0x1f0d87(0xe2))=>{const _0x47cdb1=_0x1f0d87,_0xc90853={'TqtbO':function(_0x11f7f2,_0x2d4e15){return _0x11f7f2===_0x2d4e15;},'wluBg':_0x47cdb1(0xe2),'NSGix':function(_0x2121e5,_0x4b1813){return _0x2121e5(_0x4b1813);},'QHtIP':_0x47cdb1(0xf5)};try{if(_0xc90853[_0x47cdb1(0xde)](_0x792c82,_0xc90853[_0x47cdb1(0xf6)]))return await axios[_0x47cdb1(0xe5)](baseUrl+(_0x47cdb1(0xec)+_0x47cdb1(0xe4))+_0xc90853[_0x47cdb1(0xf2)](encodeURIComponent,_0x2d6ba2)+_0x47cdb1(0xf8)+_0x347fa3)[_0x47cdb1(0xe8)](({data:_0x3a1a4c})=>_0x3a1a4c);return await axios[_0x47cdb1(0xe5)](baseUrl+(_0x47cdb1(0xe6)+_0x47cdb1(0xed)+'r=')+_0x792c82+_0x47cdb1(0xf4)+_0xc90853[_0x47cdb1(0xf2)](encodeURIComponent,_0x2d6ba2)+_0x47cdb1(0xf8)+_0x347fa3)[_0x47cdb1(0xe8)](({data:_0x258a7b})=>_0x258a7b);}catch(_0x14d737){return{'status':![],'creator':_0xc90853[_0x47cdb1(0xeb)],'message':_0x14d737[_0x47cdb1(0xe1)]};}};function _0x4794(){const _0x18f92a=['3UiDlBM','TqtbO','-features-','oyeb.app/','message','anya','pikabotz.k','sage=','get','charactera','5883632UAwIak','then','1709474yHCMfJ','12654624UvUyjP','QHtIP','anyaai?mes','i?characte','381885IQOnDP','26271306EeMHwg','6366tOJiHD','https://ai','NSGix','axios','&message=','@PikaBotz','wluBg','2619082MpqaVv','&turnid=','3655IjDrAO','exports'];_0x4794=function(){return _0x18f92a;};return _0x4794();}module[_0x1f0d87(0xdc)]={'cai':cai};
