//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x29f891=_0x2e68;(function(_0x3d4762,_0x2c57bf){const _0x57b8c2=_0x2e68,_0x251382=_0x3d4762();while(!![]){try{const _0x42bce4=parseInt(_0x57b8c2(0x84))/(0x113c+0x10*0x197+0x3*-0xe39)*(parseInt(_0x57b8c2(0x81))/(0xcfb+0x1949*-0x1+0xc50))+parseInt(_0x57b8c2(0x93))/(-0x315+0xe*0x2b2+-0x2*0x1152)+parseInt(_0x57b8c2(0x99))/(0x42d*-0x4+-0xa47+0x1aff)*(parseInt(_0x57b8c2(0x80))/(0x16b*-0xa+0x9e0+0x453))+-parseInt(_0x57b8c2(0x96))/(0x7*-0x3e6+-0x641*-0x1+0x150f)*(-parseInt(_0x57b8c2(0x82))/(-0x1523*-0x1+0x2*-0xa12+-0x7c*0x2))+parseInt(_0x57b8c2(0x8d))/(0x3c6*0x3+-0xd6e+0x4*0x89)+parseInt(_0x57b8c2(0x7e))/(-0x163*0x9+-0x1a12+0x2696)+-parseInt(_0x57b8c2(0x8a))/(0x335*0xb+-0x280+-0x20bd)*(parseInt(_0x57b8c2(0x83))/(0x85c+0x1*0x1862+0xb*-0x2f9));if(_0x42bce4===_0x2c57bf)break;else _0x251382['push'](_0x251382['shift']());}catch(_0x24add7){_0x251382['push'](_0x251382['shift']());}}}(_0x5b31,0xbd319*0x1+-0x2be8e*-0x3+-0x9*0x158fe));function _0x2e68(_0x643719,_0x503be3){const _0x2b64b4=_0x5b31();return _0x2e68=function(_0x12cb0e,_0x11d7cb){_0x12cb0e=_0x12cb0e-(-0x1*0x61c+-0x17fb+0x1e95);let _0x3c3caa=_0x2b64b4[_0x12cb0e];return _0x3c3caa;},_0x2e68(_0x643719,_0x503be3);}function _0x5b31(){const _0x281976=['ZWRVm','i?message=','Character\x20','&turnid=','AjEVB','10ijZxKh','get','ted','4086936whdvQZ','&object=','anyacharaa','message','oyeb.app/','https://ai','2887776KhHZid','anya','exports','6ReWDdx','-features-','pikabotz.k','4AugtKC','axios','XDWzk','@PikaBotz','GSjDc','not\x20suppor','2492352KpHEXD','then','4830740bbHubF','56572vfOjyL','4984301KDnYMJ','43199607nyvSBL','36wTopgf'];_0x5b31=function(){return _0x281976;};return _0x5b31();}const axios=require(_0x29f891(0x9a)),baseUrl=_0x29f891(0x92)+_0x29f891(0x97)+_0x29f891(0x98)+_0x29f891(0x91),cai=async(_0x54889f,_0x2b0274,_0x3c7b84=_0x29f891(0x94),_0x6560fc=![])=>{const _0x17c809=_0x29f891,_0x4201e3={'ZWRVm':_0x17c809(0x94),'XDWzk':function(_0x165d7c,_0x524f69){return _0x165d7c(_0x524f69);},'AjEVB':_0x17c809(0x87)+_0x17c809(0x9e)+_0x17c809(0x8c),'GSjDc':_0x17c809(0x9c)};try{switch(_0x3c7b84){case _0x4201e3[_0x17c809(0x85)]:return await axios[_0x17c809(0x8b)](baseUrl+(_0x17c809(0x8f)+_0x17c809(0x86))+_0x4201e3[_0x17c809(0x9b)](encodeURIComponent,_0x2b0274)+_0x17c809(0x88)+_0x54889f+_0x17c809(0x8e)+_0x6560fc)[_0x17c809(0x7f)](({data:_0x4db789})=>_0x4db789);default:throw new Error(_0x4201e3[_0x17c809(0x89)]);}}catch(_0x3f17b4){return{'status':![],'creator':_0x4201e3[_0x17c809(0x9d)],'message':_0x3f17b4[_0x17c809(0x90)]};}};module[_0x29f891(0x95)]={'cai':cai};
