//      ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗
//      ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║
//      ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║
//      ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║
//      ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║
//      ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝

//      ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░
//      ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗
//      ███████║██╔██╗██║░╚████╔╝░███████║
//      ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║
//      ██║░░██║██║░╚███║░░░██║░░░██║░░██║
//      ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝

//      ██╗░░░██╗███████╗██████╗░░░░██████╗░
//      ██║░░░██║██╔════╝██╔══██╗░░░╚════██╗
//      ╚██╗░██╔╝█████╗░░██████╔╝░░░░░███╔═╝
//      ░╚████╔╝░██╔══╝░░██╔══██╗░░░██╔══╝░░
//      ░░╚██╔╝░░███████╗██║░░██║██╗███████╗
//      ░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═╝╚══════╝


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x550809=_0x3bb7;(function(_0x41f8f8,_0x7befe8){const _0x593108=_0x3bb7,_0x2b1325=_0x41f8f8();while(!![]){try{const _0x430766=-parseInt(_0x593108(0x101))/(0xe72+-0x1d*0x61+-0x44*0xd)*(parseInt(_0x593108(0x110))/(-0x1*0x244d+0x1b56+-0x1*-0x8f9))+parseInt(_0x593108(0x105))/(0x2fe*-0x5+-0x8e2*-0x3+-0x1*0xbad)*(parseInt(_0x593108(0x11e))/(0x2547+0x447+0x199*-0x1a))+-parseInt(_0x593108(0x10f))/(-0x23a6+-0xfd3+0x3*0x112a)*(parseInt(_0x593108(0x109))/(0x223d+0xb27+-0x2d5e))+-parseInt(_0x593108(0x114))/(-0x2154+-0xa93*-0x1+0x16c8)+parseInt(_0x593108(0x108))/(0xc66+0xdfb+-0x1a59)+-parseInt(_0x593108(0x117))/(0x1*0x2405+0x136f+-0x1*0x376b)*(-parseInt(_0x593108(0x10b))/(-0x2454+0x3be*-0x7+0x3e90))+-parseInt(_0x593108(0x11c))/(-0x255c+-0x1b3f+-0x40a6*-0x1);if(_0x430766===_0x7befe8)break;else _0x2b1325['push'](_0x2b1325['shift']());}catch(_0x44b119){_0x2b1325['push'](_0x2b1325['shift']());}}}(_0x1303,-0x98595+-0x293*-0x2f5+0x10*0x977b));const axios=require(_0x550809(0x100));function _0x3bb7(_0xea47ba,_0x47f1c3){const _0x5307e2=_0x1303();return _0x3bb7=function(_0x1790a0,_0x5ae2b5){_0x1790a0=_0x1790a0-(0x2368+-0x2f*-0xad+-0x422c);let _0x4dab02=_0x5307e2[_0x1790a0];return _0x4dab02;},_0x3bb7(_0xea47ba,_0x47f1c3);}module[_0x550809(0x115)]={'api':{'pastebin':_0x550809(0x10e)+_0x550809(0x111)+_0x550809(0x10a)+'rg','apiHubRaw':_0x550809(0x10d)+_0x550809(0x10c)+_0x550809(0x113),'apiYtVid':_0x550809(0x106)+_0x550809(0x103)+_0x550809(0x11a)+'/','apiHubKey':_0x550809(0x102),'apiHub':function(_0x4d5998,_0x4ce150,_0x4474a2){const _0x1de924=_0x550809,_0x2f2bf4={'mijHQ':function(_0xde14ed,_0x9401b6){return _0xde14ed+_0x9401b6;},'bkKbk':function(_0xd67df5,_0x290a54){return _0xd67df5+_0x290a54;},'pjwjQ':function(_0x53285,_0xf8f783){return _0x53285+_0xf8f783;},'jDorf':_0x1de924(0x119)};return axios[_0x1de924(0x112)](_0x2f2bf4[_0x1de924(0x11b)](_0x2f2bf4[_0x1de924(0x11b)](_0x2f2bf4[_0x1de924(0x11b)](_0x2f2bf4[_0x1de924(0xff)](_0x2f2bf4[_0x1de924(0x107)](_0x2f2bf4[_0x1de924(0x11b)](_0x2f2bf4[_0x1de924(0x107)](this[_0x1de924(0x11f)],_0x4d5998),'/'),_0x4ce150),_0x2f2bf4[_0x1de924(0x118)]),this[_0x1de924(0x11d)]),'&'),_0x4474a2?_0x4474a2:''))[_0x1de924(0x104)](_0x264f1f=>_0x264f1f[_0x1de924(0x116)]);}}};function _0x1303(){const _0x1b1d4a=['2400349iQbMDo','exports','data','9FMyogR','jDorf','?key=','vercel.app','mijHQ','1750650iyrtPu','apiHubKey','4DnEoKR','apiHubRaw','bkKbk','axios','7ZdvhZY','pikakun','dnld-kohl.','then','2089191OTvRCK','https://yt','pjwjQ','5658600NunxfD','351510BvNMBd','3UbAdBanTt','2979890fwGczm','kaapi.verc','https://pi','bHnb-Bwymo','20cGPSRD','134288PETRwh','L3wdX6gSXd','get','el.app/'];_0x1303=function(){return _0x1b1d4a;};return _0x1303();}
