//      ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗
//      ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║
//      ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║
//      ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║
//      ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║
//      ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝

//      ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░
//      ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗
//      ███████║██╔██╗██║░╚████╔╝░███████║
//      ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║
//      ██║░░██║██║░╚███║░░░██║░░░██║░░██║
//      ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝

//      ██╗░░░██╗███████╗██████╗░░░░██████╗░
//      ██║░░░██║██╔════╝██╔══██╗░░░╚════██╗
//      ╚██╗░██╔╝█████╗░░██████╔╝░░░░░███╔═╝
//      ░╚████╔╝░██╔══╝░░██╔══██╗░░░██╔══╝░░
//      ░░╚██╔╝░░███████╗██║░░██║██╗███████╗
//      ░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═╝╚══════╝


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x137f5d=_0x5e56;(function(_0xf2e0fc,_0x46e5af){const _0x1a0fa3=_0x5e56,_0xce7005=_0xf2e0fc();while(!![]){try{const _0x505622=-parseInt(_0x1a0fa3(0xb5))/(0x6c9+0x18c+-0x854)+parseInt(_0x1a0fa3(0xbc))/(0x9f6+0x1fc5+-0x29b9)*(parseInt(_0x1a0fa3(0xb9))/(-0x12a6+0x4c8*-0x3+0x2101))+-parseInt(_0x1a0fa3(0xb7))/(0x24e0+0x124+-0x2600)*(parseInt(_0x1a0fa3(0xc7))/(-0x1b31+0x4*0x2c+0x1a86))+parseInt(_0x1a0fa3(0xc2))/(-0x1ede+-0x19eb+0x38cf)*(-parseInt(_0x1a0fa3(0xb2))/(0xeb2+-0x7a8+-0x703))+parseInt(_0x1a0fa3(0xcd))/(0xb*0x312+-0x1*0x211d+-0xa1)+parseInt(_0x1a0fa3(0xc4))/(-0x5*-0x7a+-0x265+-0xc*-0x1)+-parseInt(_0x1a0fa3(0xcc))/(-0x1099+-0x91d*0x2+0x22dd)*(-parseInt(_0x1a0fa3(0xc8))/(-0x5*0x2ef+0x43f+0x13*0x8d));if(_0x505622===_0x46e5af)break;else _0xce7005['push'](_0xce7005['shift']());}catch(_0xe99dce){_0xce7005['push'](_0xce7005['shift']());}}}(_0x50c8,-0x32d72+-0x25f8d*0x8+0x1b07*0x13b));function _0x50c8(){const _0x5d1d1f=['1347901VKDvVW','fs-extra','2128JaGMMI','QiupR','9TRgHVR','utf-8','download','559938BrKQKw','from','exports','fromURL','replace','https://me','4286976kEHkDC','toString','655857UEbCcY','./myfunc','fs/promise','6095dzZyAV','15741pAQmwS','base64','ga.nz/file','megajs','8300hjakwA','10698992ZVXXNr','7IHtlTX','MLqzu','writeFile'];_0x50c8=function(){return _0x5d1d1f;};return _0x50c8();}const fs=require(_0x137f5d(0xb6)),{writeFile}=require(_0x137f5d(0xc6)+'s'),{File}=require(_0x137f5d(0xcb)),{delay}=require(_0x137f5d(0xc5));function _0x5e56(_0x1291ff,_0x3b37b0){const _0x3e3d54=_0x50c8();return _0x5e56=function(_0x2f3bc8,_0xeef3b6){_0x2f3bc8=_0x2f3bc8-(0x1e09*-0x1+0xf36+0xf85);let _0x3f07b8=_0x3e3d54[_0x2f3bc8];return _0x3f07b8;},_0x5e56(_0x1291ff,_0x3b37b0);}module[_0x137f5d(0xbe)]={async 'MakeSession'(_0x93a88a,_0x218f80){const _0x4057ae=_0x137f5d,_0x23f902={'MLqzu':_0x4057ae(0xc9),'QiupR':_0x4057ae(0xba)};let _0x2f03f9=_0x93a88a[_0x4057ae(0xc0)](/_Queen-Anya_/g,''),_0x28dbf5=Buffer[_0x4057ae(0xbd)](_0x2f03f9,_0x23f902[_0x4057ae(0xb3)])[_0x4057ae(0xc3)](_0x23f902[_0x4057ae(0xb8)]);const _0x3cdcc1=_0x4057ae(0xc1)+_0x4057ae(0xca)+'/'+_0x28dbf5,_0x2362ca=File[_0x4057ae(0xbf)](_0x3cdcc1);_0x2362ca[_0x4057ae(0xbb)]((_0x114785,_0x4dc4ea)=>{const _0x4a93d4=_0x4057ae;if(_0x114785)throw _0x114785;fs[_0x4a93d4(0xb4)](_0x218f80,_0x4dc4ea);});}};
