//      ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗
//      ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║
//      ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║
//      ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║
//      ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║
//      ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝

//      ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░
//      ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗
//      ███████║██╔██╗██║░╚████╔╝░███████║
//      ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║
//      ██║░░██║██║░╚███║░░░██║░░░██║░░██║
//      ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝

//      ██╗░░░██╗███████╗██████╗░░░░██████╗░
//      ██║░░░██║██╔════╝██╔══██╗░░░╚════██╗
//      ╚██╗░██╔╝█████╗░░██████╔╝░░░░░███╔═╝
//      ░╚████╔╝░██╔══╝░░██╔══██╗░░░██╔══╝░░
//      ░░╚██╔╝░░███████╗██║░░██║██╗███████╗
//      ░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═╝╚══════╝


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x26a32a=_0x491e;function _0x1de2(){const _0x164f19=['1189719DEVoyy','...','3515048WODUgE','2544AgALHU','24080DjGDQB','i.pastelin','d2xih5xk64','2cwdbap','🌍\x20Entering','gsf7vt9brk','KkayC','body','paste?api_','kqpfaa3w9a','from','./myfunc','writeFileS','UhfHq','replace','255006JwtcdQ','fs-extra','iUrcd','1010460RGBcsR','YFOEo','url=','sfuw22xbog','4089940LrVqEb','base64','k.net/get-','iwq429794&','axios','get','MHXOj','utf-8','log','ryz46ucc3i','key=aedjjq','49abs6syzt','ync','https://ap','\x20Queen\x20Any','a\x20Universe','toString','OGFOM','exports','jguzj','4458450liLbET'];_0x1de2=function(){return _0x164f19;};return _0x1de2();}(function(_0x2d34ff,_0x3b8eaa){const _0x2046ca=_0x491e,_0x17c606=_0x2d34ff();while(!![]){try{const _0x21c908=-parseInt(_0x2046ca(0x17b))/(0x1acb+-0x5b*0x4+-0x195e)*(-parseInt(_0x2046ca(0x182))/(0x182b+0x6bc+-0x1ee5))+-parseInt(_0x2046ca(0x191))/(0xc72+-0x439*0x1+0x1*-0x836)+parseInt(_0x2046ca(0x17d))/(0x757*-0x4+-0x1*0x3f5+-0xa1*-0x35)+parseInt(_0x2046ca(0x195))/(-0x4*-0x944+0x19ae+0x3eb9*-0x1)+-parseInt(_0x2046ca(0x17a))/(-0x1*0x1a9f+0x6d*0xd+0x4*0x547)+-parseInt(_0x2046ca(0x17f))/(0x7*-0x2c4+0x116+-0x1*-0x124d)*(parseInt(_0x2046ca(0x17e))/(0x1731+0x821*0x3+-0x11*0x2cc))+parseInt(_0x2046ca(0x18e))/(0x2*0x1de+0x1*-0x1cf3+0x1940);if(_0x21c908===_0x3b8eaa)break;else _0x17c606['push'](_0x17c606['shift']());}catch(_0x298048){_0x17c606['push'](_0x17c606['shift']());}}}(_0x1de2,0x9*-0x14956+-0x3e716+-0x32c*-0x872));function _0x491e(_0x5772af,_0x457caf){const _0x140d3a=_0x1de2();return _0x491e=function(_0x578c86,_0x49d748){_0x578c86=_0x578c86-(-0x1bb1+-0x9e*0x14+0xdd3*0x3);let _0x407c36=_0x140d3a[_0x578c86];return _0x407c36;},_0x491e(_0x5772af,_0x457caf);}const fs=require(_0x26a32a(0x18f)),axios=require(_0x26a32a(0x199)),{delay}=require(_0x26a32a(0x18a));module[_0x26a32a(0x178)]={async 'MakeSession'(_0x1245b2,_0x1d6a40){const _0x4a173a=_0x26a32a,_0x5b758f={'MHXOj':_0x4a173a(0x196),'KkayC':_0x4a173a(0x19c),'iUrcd':function(_0x212dce,_0x42986b){return _0x212dce+_0x42986b;},'YFOEo':_0x4a173a(0x173)+_0x4a173a(0x180)+_0x4a173a(0x197)+_0x4a173a(0x187)+_0x4a173a(0x170)+_0x4a173a(0x171)+_0x4a173a(0x19e)+_0x4a173a(0x194)+_0x4a173a(0x184)+_0x4a173a(0x188)+_0x4a173a(0x181)+_0x4a173a(0x198)+_0x4a173a(0x193),'UhfHq':_0x4a173a(0x183)+_0x4a173a(0x174)+_0x4a173a(0x175)+_0x4a173a(0x17c),'jguzj':function(_0x3c14fe,_0x3ccb45){return _0x3c14fe(_0x3ccb45);},'OGFOM':function(_0x590599,_0x493858){return _0x590599*_0x493858;}},_0x19b6da=_0x1245b2[_0x4a173a(0x18d)](/_Queen-Anya_/g,''),_0x4cc653=Buffer[_0x4a173a(0x189)](_0x19b6da,_0x5b758f[_0x4a173a(0x19b)])[_0x4a173a(0x176)](_0x5b758f[_0x4a173a(0x185)]),{data:_0x1380f9}=await axios[_0x4a173a(0x19a)](_0x5b758f[_0x4a173a(0x190)](_0x5b758f[_0x4a173a(0x192)],_0x4cc653));await fs[_0x4a173a(0x18b)+_0x4a173a(0x172)](_0x1d6a40,_0x1380f9[_0x4a173a(0x186)]),await console[_0x4a173a(0x19d)](_0x5b758f[_0x4a173a(0x18c)]),await _0x5b758f[_0x4a173a(0x179)](delay,_0x5b758f[_0x4a173a(0x177)](-0x185b+-0xfc7+0x1*0x2c0a,0xf*-0x23d+-0xf5a+-0x30f1*-0x1));}};
