//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


function _0x3f90(){const _0x324495=['creds.json','getsession','3705eZtJiK','all','1149378XxKvtx','then','1141zQzIgJ','184vLthpw','access','creds','map','error','koyeb.app/','exports','int-fedora','mkdir','axios','unlink','288wHxcxz','-pikabot-z','1812aoRuFL','NyRzF','https://jo','31592BiUVJG','path','?id=','-3bf820dc.','readdir','1092soZNfS','get','1302090pGorfl','catch','stringify','promises','1858EZQtEe','7654493FZmrHv','writeFile','join'];_0x3f90=function(){return _0x324495;};return _0x3f90();}const _0x4d7456=_0x2f30;(function(_0x227479,_0x3bd3f4){const _0x50e02b=_0x2f30,_0x106361=_0x227479();while(!![]){try{const _0x47a8f5=parseInt(_0x50e02b(0x1d0))/(-0x7*-0x1d+0x18a+-0x254)*(parseInt(_0x50e02b(0x1eb))/(0x17*0xe5+0x4*0x1e9+-0x1c35))+-parseInt(_0x50e02b(0x1f3))/(0x23b7+-0x1fde+-0x3d6)+parseInt(_0x50e02b(0x1e5))/(0xc1a*-0x2+0x165e+0x1da)*(-parseInt(_0x50e02b(0x1f1))/(-0x1325*-0x1+-0x1*0x153d+0x21d))+parseInt(_0x50e02b(0x1dd))/(-0xe4d+-0x23*0x102+0x3199)*(-parseInt(_0x50e02b(0x1cf))/(-0x1654+-0x589+0x1be4))+parseInt(_0x50e02b(0x1e0))/(-0x1*-0x12d1+-0x176a+0x4a1)*(-parseInt(_0x50e02b(0x1db))/(-0x1843+-0x1bd6+0x3422*0x1))+parseInt(_0x50e02b(0x1e7))/(-0x2117+0x1bf4+-0x35*-0x19)+parseInt(_0x50e02b(0x1ec))/(0x1beb+0x1*-0x20d2+-0x6*-0xd3);if(_0x47a8f5===_0x3bd3f4)break;else _0x106361['push'](_0x106361['shift']());}catch(_0x1c40b3){_0x106361['push'](_0x106361['shift']());}}}(_0x3f90,0x3c88a+-0x1*-0x1212b+0x2*-0xa7ed));const fs=require('fs')[_0x4d7456(0x1ea)],axios=require(_0x4d7456(0x1d9)),path=require(_0x4d7456(0x1e1)),baseUrl=_0x4d7456(0x1df)+_0x4d7456(0x1d7)+_0x4d7456(0x1dc)+_0x4d7456(0x1e3)+_0x4d7456(0x1d5),MakeSession=async(_0x186263,_0x1a6bf0)=>{const _0x5b61be=_0x4d7456,_0x5a6485={'NyRzF':_0x5b61be(0x1ef)};try{await fs[_0x5b61be(0x1d1)](_0x1a6bf0)[_0x5b61be(0x1ce)](async()=>{const _0x5ae915=_0x5b61be,_0x8b393a=await fs[_0x5ae915(0x1e4)](_0x1a6bf0),_0x222f31=_0x8b393a[_0x5ae915(0x1d3)](_0x37683a=>fs[_0x5ae915(0x1da)](path[_0x5ae915(0x1ee)](_0x1a6bf0,_0x37683a)));await Promise[_0x5ae915(0x1f2)](_0x222f31);})[_0x5b61be(0x1e8)](_0x3fc620=>{const _0x32cb56=_0x5b61be;console[_0x32cb56(0x1d4)](_0x3fc620);}),await fs[_0x5b61be(0x1d8)](_0x1a6bf0,{'recursive':!![]});const {data:_0x316825}=await axios[_0x5b61be(0x1e6)](baseUrl+(_0x5b61be(0x1f0)+_0x5b61be(0x1e2))+_0x186263),_0xfb04de=_0x316825[_0x5b61be(0x1d2)],_0x46d199=path[_0x5b61be(0x1ee)](_0x1a6bf0,_0x5a6485[_0x5b61be(0x1de)]);await fs[_0x5b61be(0x1ed)](_0x46d199,JSON[_0x5b61be(0x1e9)](_0xfb04de,null,0x10ee*0x1+0x1622+-0x270e));}catch(_0x62888a){console[_0x5b61be(0x1d4)](_0x62888a);}};function _0x2f30(_0x4fcf0a,_0x5dd490){const _0x546286=_0x3f90();return _0x2f30=function(_0x3cac5c,_0xf5bbd6){_0x3cac5c=_0x3cac5c-(-0x1*-0x1dab+-0x158c+-0xe7*0x7);let _0x1d5e9c=_0x546286[_0x3cac5c];return _0x1d5e9c;},_0x2f30(_0x4fcf0a,_0x5dd490);}module[_0x4d7456(0x1d6)]={'MakeSession':MakeSession};
