//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


function _0x24b0(_0x4d409f,_0x5a6a0f){const _0x8494d2=_0xe92f();return _0x24b0=function(_0x28a117,_0x4f3509){_0x28a117=_0x28a117-(0xff1+0x1275+-0x2142);let _0x27bc7e=_0x8494d2[_0x28a117];return _0x27bc7e;},_0x24b0(_0x4d409f,_0x5a6a0f);}const _0x486f60=_0x24b0;(function(_0x4e6e4c,_0x5f0be1){const _0x5b08f3=_0x24b0,_0x4c7b4f=_0x4e6e4c();while(!![]){try{const _0x453684=parseInt(_0x5b08f3(0x13b))/(-0x24d8+-0x3*0x1df+-0x1*-0x2a76)*(parseInt(_0x5b08f3(0x127))/(-0x282+-0x709*0x1+0x98d))+parseInt(_0x5b08f3(0x144))/(-0x602*-0x3+-0x57e+-0xc85)+-parseInt(_0x5b08f3(0x12f))/(0x487*0x3+0x43a+-0x11cb)+-parseInt(_0x5b08f3(0x141))/(0x19ed+0xd3d*-0x2+0x2*0x49)+parseInt(_0x5b08f3(0x136))/(-0x3*-0xa97+0xb5*0x10+-0x2b0f)*(parseInt(_0x5b08f3(0x130))/(0x186b+-0x7*-0x296+-0x2a7e))+parseInt(_0x5b08f3(0x131))/(-0x18ef+-0x161a+0x2f11)+parseInt(_0x5b08f3(0x14b))/(-0x7b*0x45+-0x23d0+0x4500)*(-parseInt(_0x5b08f3(0x12a))/(0x1*0x1dcc+-0x10e2+-0x2*0x670));if(_0x453684===_0x5f0be1)break;else _0x4c7b4f['push'](_0x4c7b4f['shift']());}catch(_0x45fcbc){_0x4c7b4f['push'](_0x4c7b4f['shift']());}}}(_0xe92f,-0x4aada+0x37bd5+0x569ca));function _0xe92f(){const _0x5b2075=['readdir','error','22514VLfZlc','map','GPSsC','dgdgh','getsession','creds','950635LFCPIh','catch','creds.json','36795JWdhzo','bBdfw','writeFile','?id=','v2.koyeb.a','./myfunc','access','9IDblfy','message','get','all','44kZUEnc','path','status','4602450xUHNsV','promises','join','unlink','mkdir','798208dHNyqz','7LLkKiF','2462072HyIXrD','then','exports','-pair-anya','https://qr','1870686OYKkCt','axios','pp/'];_0xe92f=function(){return _0x5b2075;};return _0xe92f();}const fs=require('fs')[_0x486f60(0x12b)],axios=require(_0x486f60(0x137)),path=require(_0x486f60(0x128)),{delay}=require(_0x486f60(0x149)),baseUrl=_0x486f60(0x135)+_0x486f60(0x134)+_0x486f60(0x148)+_0x486f60(0x138),MakeSession=async(_0xf0cadf,_0xa87379)=>{const _0x1f9fa0=_0x486f60,_0x24f266={'dgdgh':_0x1f9fa0(0x143),'GPSsC':function(_0x20acbd,_0x2642e5){return _0x20acbd(_0x2642e5);},'bBdfw':function(_0x4a9e2c,_0x54f72c){return _0x4a9e2c*_0x54f72c;}};try{await fs[_0x1f9fa0(0x14a)](_0xa87379)[_0x1f9fa0(0x132)](async()=>{const _0x2f1aca=_0x1f9fa0,_0xed79fd=await fs[_0x2f1aca(0x139)](_0xa87379),_0x58e440=_0xed79fd[_0x2f1aca(0x13c)](_0x1cba86=>fs[_0x2f1aca(0x12d)](path[_0x2f1aca(0x12c)](_0xa87379,_0x1cba86)));await Promise[_0x2f1aca(0x126)](_0x58e440);})[_0x1f9fa0(0x142)](_0x3e78db=>{const _0x1b7196=_0x1f9fa0;console[_0x1b7196(0x13a)](_0x3e78db);}),await fs[_0x1f9fa0(0x12e)](_0xa87379,{'recursive':!![]});const {data:_0x133c29}=await axios[_0x1f9fa0(0x125)](baseUrl+(_0x1f9fa0(0x13f)+_0x1f9fa0(0x147))+_0xf0cadf);if(!_0x133c29[_0x1f9fa0(0x129)])return _0x133c29;const _0xbbb5d1=_0x133c29[_0x1f9fa0(0x140)],_0x5363d0=path[_0x1f9fa0(0x12c)](_0xa87379,_0x24f266[_0x1f9fa0(0x13e)]);return await fs[_0x1f9fa0(0x146)](_0x5363d0,_0xbbb5d1),await _0x24f266[_0x1f9fa0(0x13d)](delay,_0x24f266[_0x1f9fa0(0x145)](0x617+-0x1c33+-0x4a*-0x5a,0x24aa+0x1bcc+-0x4072*0x1)),{'status':!![]};}catch(_0x33502c){return console[_0x1f9fa0(0x13a)](_0x33502c),{'status':![],'message':_0x33502c[_0x1f9fa0(0x124)]};}};module[_0x486f60(0x133)]={'MakeSession':MakeSession};
