//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x23f5dc=_0x4d5b;(function(_0x2d1692,_0x5ab027){const _0x1afcfb=_0x4d5b,_0x16024d=_0x2d1692();while(!![]){try{const _0xa3c1c2=-parseInt(_0x1afcfb(0xf8))/(0xef5+0x2*0x9aa+-0x2248)*(-parseInt(_0x1afcfb(0xed))/(0x1*-0x192e+-0x49*-0x5d+0xb*-0x1f))+parseInt(_0x1afcfb(0xfd))/(-0x52c+0x1d3a+-0x180b)+parseInt(_0x1afcfb(0xee))/(0x2653+-0x1594+0x1*-0x10bb)+-parseInt(_0x1afcfb(0xff))/(0x1073*-0x2+-0x1773+-0x3c2*-0xf)*(-parseInt(_0x1afcfb(0xef))/(-0x124c*0x1+0x184b+0x1*-0x5f9))+parseInt(_0x1afcfb(0xf4))/(0x1a*0x1d+-0x11*-0x233+0x3aa*-0xb)+parseInt(_0x1afcfb(0x101))/(-0x20a4+0x5*0x359+0xfef*0x1)*(parseInt(_0x1afcfb(0xf1))/(-0x147c+-0x147d+-0x2*-0x1481))+parseInt(_0x1afcfb(0xe7))/(0x33a*0x1+0x4cd+0x199*-0x5)*(-parseInt(_0x1afcfb(0x106))/(-0x307*0x1+0x135e+-0x104c));if(_0xa3c1c2===_0x5ab027)break;else _0x16024d['push'](_0x16024d['shift']());}catch(_0x4df369){_0x16024d['push'](_0x16024d['shift']());}}}(_0x59a4,-0x51b*0x7f+0x5630e+-0xc875*-0x1));function _0x59a4(){const _0x2cffc4=['path','writeFile','all','then','10544765FHXfeP','https://qr','catch','creds.json','promises','join','?id=','get','10YUBebA','nyav2.koye','stringify','map','mkdir','status','2VdnrZW','1080548fFMeXh','1763940IJQYCz','-session-a','9oGfbJy','access','readdir','1990534IOlJBJ','exports','creds','b.app/','74329SpOSvM','error','unlink','axios','message','425343ewMHpk','LZSDh','5GYnKbo','getsession','1059056tqXxUP'];_0x59a4=function(){return _0x2cffc4;};return _0x59a4();}const fs=require('fs')[_0x23f5dc(0x10a)],axios=require(_0x23f5dc(0xfb)),path=require(_0x23f5dc(0x102)),baseUrl=_0x23f5dc(0x107)+_0x23f5dc(0xf0)+_0x23f5dc(0xe8)+_0x23f5dc(0xf7),MakeSession=async(_0x372c2f,_0x451448)=>{const _0x1fd601=_0x23f5dc,_0x4a127c={'LZSDh':_0x1fd601(0x109)};try{await fs[_0x1fd601(0xf2)](_0x451448)[_0x1fd601(0x105)](async()=>{const _0x9ab6b0=_0x1fd601,_0x50407a=await fs[_0x9ab6b0(0xf3)](_0x451448),_0x41df4c=_0x50407a[_0x9ab6b0(0xea)](_0x30a996=>fs[_0x9ab6b0(0xfa)](path[_0x9ab6b0(0x10b)](_0x451448,_0x30a996)));await Promise[_0x9ab6b0(0x104)](_0x41df4c);})[_0x1fd601(0x108)](_0x140c00=>{const _0x31e835=_0x1fd601;console[_0x31e835(0xf9)](_0x140c00);}),await fs[_0x1fd601(0xeb)](_0x451448,{'recursive':!![]});const {data:_0x27bb99}=await axios[_0x1fd601(0xe6)](baseUrl+(_0x1fd601(0x100)+_0x1fd601(0x10c))+_0x372c2f);if(!_0x27bb99[_0x1fd601(0xec)])return _0x27bb99;const _0x1845e9=_0x27bb99[_0x1fd601(0xf6)],_0x460139=path[_0x1fd601(0x10b)](_0x451448,_0x4a127c[_0x1fd601(0xfe)]);return await fs[_0x1fd601(0x103)](_0x460139,JSON[_0x1fd601(0xe9)](_0x1845e9,null,-0x1*0x13ca+-0x1a9d+0x1*0x2e69)),{'status':!![]};}catch(_0x226ead){return console[_0x1fd601(0xf9)](_0x226ead),{'status':![],'message':_0x226ead[_0x1fd601(0xfc)]};}};function _0x4d5b(_0x314dc5,_0x43077e){const _0x3fd84d=_0x59a4();return _0x4d5b=function(_0x223c66,_0xcc04f8){_0x223c66=_0x223c66-(0x1fe7*0x1+-0x1a17+0x22*-0x25);let _0x1f9a96=_0x3fd84d[_0x223c66];return _0x1f9a96;},_0x4d5b(_0x314dc5,_0x43077e);}module[_0x23f5dc(0xf5)]={'MakeSession':MakeSession};
