//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x59f512=_0x42fd;(function(_0x165e26,_0x4b1753){const _0x29176a=_0x42fd,_0x826752=_0x165e26();while(!![]){try{const _0x16d46b=-parseInt(_0x29176a(0x1a9))/(0x13*0x100+0x81*0x2c+-0x292b)+-parseInt(_0x29176a(0x1c2))/(-0xb57+0x1*-0xcbe+0x1817)+-parseInt(_0x29176a(0x1b6))/(-0x5*-0xcd+0x2c1+-0x6bf)+-parseInt(_0x29176a(0x1af))/(0x1364+0x1*-0x2552+0x8f9*0x2)*(parseInt(_0x29176a(0x1ad))/(0x1f7c+0x11ee+0x5*-0x9e1))+parseInt(_0x29176a(0x1a8))/(-0x3*0x535+0x1711+-0x32*0x26)+parseInt(_0x29176a(0x1a7))/(-0x14ab+-0x11b8+0x266a)+parseInt(_0x29176a(0x1ba))/(-0x3b*0xf+0xab1+0x1*-0x734);if(_0x16d46b===_0x4b1753)break;else _0x826752['push'](_0x826752['shift']());}catch(_0x3c21a5){_0x826752['push'](_0x826752['shift']());}}}(_0x3458,-0x79*0x9e+-0x1*-0x59bc9+-0xf58d));function _0x3458(){const _0x36a0a3=['map','1627064cALbdj','creds','then','https://qr','ppOKI','readdir','getsession','217134KDWPuS','ZPNBk','v2.koyeb.a','unlink','7765192vPLQMU','access','pp/','oVqET','exports','writeFile','error','promises','1130318yqLJJe','status','catch','message','path','axios','get','join','all','-pair-anya','2684640mplIhs','893688HJSyCc','173232maMIjl','?id=','mkdir','creds.json','5VRAHlo'];_0x3458=function(){return _0x36a0a3;};return _0x3458();}const fs=require('fs')[_0x59f512(0x1c1)],axios=require(_0x59f512(0x1c7)),path=require(_0x59f512(0x1c6)),baseUrl=_0x59f512(0x1b2)+_0x59f512(0x1a6)+_0x59f512(0x1b8)+_0x59f512(0x1bc),MakeSession=async(_0x48e64e,_0x37fbb5)=>{const _0x5245fe=_0x59f512,_0x5ad203={'oVqET':_0x5245fe(0x1ac),'ZPNBk':function(_0xa6f4b6,_0x4cb81e){return _0xa6f4b6(_0x4cb81e);},'ppOKI':function(_0x2b3df6,_0x5dfeb6){return _0x2b3df6*_0x5dfeb6;}};try{await fs[_0x5245fe(0x1bb)](_0x37fbb5)[_0x5245fe(0x1b1)](async()=>{const _0x3bb8ec=_0x5245fe,_0x2e6c02=await fs[_0x3bb8ec(0x1b4)](_0x37fbb5),_0x309592=_0x2e6c02[_0x3bb8ec(0x1ae)](_0x523b32=>fs[_0x3bb8ec(0x1b9)](path[_0x3bb8ec(0x1a4)](_0x37fbb5,_0x523b32)));await Promise[_0x3bb8ec(0x1a5)](_0x309592);})[_0x5245fe(0x1c4)](_0xadeaa8=>{const _0x15d642=_0x5245fe;console[_0x15d642(0x1c0)](_0xadeaa8);}),await fs[_0x5245fe(0x1ab)](_0x37fbb5,{'recursive':!![]});const {data:_0x7a017c}=await axios[_0x5245fe(0x1a3)](baseUrl+(_0x5245fe(0x1b5)+_0x5245fe(0x1aa))+_0x48e64e);if(!_0x7a017c[_0x5245fe(0x1c3)])return _0x7a017c;const _0x122efb=_0x7a017c[_0x5245fe(0x1b0)],_0x57f7eb=path[_0x5245fe(0x1a4)](_0x37fbb5,_0x5ad203[_0x5245fe(0x1bd)]);return await fs[_0x5245fe(0x1bf)](_0x57f7eb,_0x122efb),await _0x5ad203[_0x5245fe(0x1b7)](delay,_0x5ad203[_0x5245fe(0x1b3)](0x219*0x11+0x1*0x23c+0x7*-0x4db,-0x25dd+0x2177+0x46a)),{'status':!![]};}catch(_0x198c49){return console[_0x5245fe(0x1c0)](_0x198c49),{'status':![],'message':_0x198c49[_0x5245fe(0x1c5)]};}};function _0x42fd(_0x14b05b,_0x4d1839){const _0x186c21=_0x3458();return _0x42fd=function(_0x44f95a,_0x324c3f){_0x44f95a=_0x44f95a-(0x2*0x1f3+0x25b*0x3+-0x4aa*0x2);let _0x2a9ef3=_0x186c21[_0x44f95a];return _0x2a9ef3;},_0x42fd(_0x14b05b,_0x4d1839);}module[_0x59f512(0x1be)]={'MakeSession':MakeSession};
