//  
//          ░██████╗░██╗░░░██╗███████╗███████╗███╗░░██╗         ░█████╗░███╗░░██╗██╗░░░██╗░█████╗░          ██╗░░░██╗██████╗░
//          ██╔═══██╗██║░░░██║██╔════╝██╔════╝████╗░██║         ██╔══██╗████╗░██║╚██╗░██╔╝██╔══██╗          ██║░░░██║╚════██╗
//          ██║██╗██║██║░░░██║█████╗░░█████╗░░██╔██╗██║         ███████║██╔██╗██║░╚████╔╝░███████║          ╚██╗░██╔╝░░███╔═╝
//          ╚██████╔╝██║░░░██║██╔══╝░░██╔══╝░░██║╚████║         ██╔══██║██║╚████║░░╚██╔╝░░██╔══██║          ░╚████╔╝░██╔══╝░░
//          ░╚═██╔═╝░╚██████╔╝███████╗███████╗██║░╚███║         ██║░░██║██║░╚███║░░░██║░░░██║░░██║          ░░╚██╔╝░░███████╗
//          ░░░╚═╝░░░░╚═════╝░╚══════╝╚══════╝╚═╝░░╚══╝         ╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝          ░░░╚═╝░░░╚══════╝
//                                                                                                                                                          


/*
        📝 𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗡𝗮𝗺𝗲: Queen Anya Ver.2
        🐙 𝗚𝗶𝘁𝗵𝘂𝗯 𝗥𝗲𝗽𝗼𝘀𝗶𝘁𝗼𝗿𝘆: [PikaBotz/Anya_v2-MD](https://github.com/PikaBotz/Anya_v2-MD)
        👤 𝗢𝘄𝗻𝗲𝗿/𝗖𝗿𝗲𝗮𝘁𝗼𝗿: @PikaBotz
        📌 𝗗𝗲𝘀𝗰𝗿𝗶𝗽𝘁𝗶𝗼𝗻:
        Queen Anya v2 is a versatile WhatsApp bot equipped with a variety of plugins for tasks, games, and utilities. 
        It aims to enhance your messaging experience by combining efficiency and entertainment in a user-friendly package.
        
        📅 𝗖𝗿𝗲𝗮𝘁𝗶𝗼𝗻: 22/12/2022 at 08:25:10
        📜 𝗟𝗶𝗰𝗲𝗻𝗰𝗲: GPL-3.0 License
        ⚠️ 𝗥𝗶𝗴𝗵𝘁𝘀 𝗡𝗼𝘁𝗶𝗰𝗲:
        2024 All external and internal rights are reserved to @PikaBotz.
*/


//      █▄─▄▄─█▄─▄█▄─█─▄██▀▄─██▄─▄─▀█─▄▄─█─▄─▄─█░▄▄░▄█
//      ██─▄▄▄██─███─▄▀███─▀─███─▄─▀█─██─███─████▀▄█▀█
//      ▀▄▄▄▀▀▀▄▄▄▀▄▄▀▄▄▀▄▄▀▄▄▀▄▄▄▄▀▀▄▄▄▄▀▀▄▄▄▀▀▄▄▄▄▄▀

//      █▄─▄█▄─▀█▄─▄█─▄▄▄─█████
//      ██─███─█▄▀─██─███▀█░░██
//      ▀▄▄▄▀▄▄▄▀▀▄▄▀▄▄▄▄▄▀▄▄▀▀


const _0x315a7a=_0x2427;(function(_0x250a2f,_0x118bee){const _0x2a8b08=_0x2427,_0x5dd6d2=_0x250a2f();while(!![]){try{const _0x1974fd=parseInt(_0x2a8b08(0xec))/(-0x240e*-0x1+0x1*0x112+-0x2db*0xd)+-parseInt(_0x2a8b08(0xf2))/(0x5e9+-0x2015+0x1a2e)+parseInt(_0x2a8b08(0xe8))/(-0x2149+-0x283*-0xf+-0x461)+parseInt(_0x2a8b08(0xdf))/(0x1825+0x15b6+0x2dd7*-0x1)*(-parseInt(_0x2a8b08(0xd7))/(0x101c+-0x17*-0x169+-0x3086))+-parseInt(_0x2a8b08(0xe9))/(0x57*-0x31+-0x26ea+0x7*0x7f1)*(parseInt(_0x2a8b08(0xfb))/(0xba6+-0xf2*-0x24+-0x2da7))+-parseInt(_0x2a8b08(0xf4))/(-0x15ad+0x60e+0xfa7*0x1)+parseInt(_0x2a8b08(0xe1))/(0x1*0x167e+0xa11*-0x3+0x7be)*(parseInt(_0x2a8b08(0xfa))/(-0x1126+-0x2548+0x914*0x6));if(_0x1974fd===_0x118bee)break;else _0x5dd6d2['push'](_0x5dd6d2['shift']());}catch(_0x11fbe3){_0x5dd6d2['push'](_0x5dd6d2['shift']());}}}(_0x44df,-0x256bb*-0x1+0x285e7+-0x271f*0xf));function _0x2427(_0xa5ce8c,_0x2f4299){const _0xb8fd2b=_0x44df();return _0x2427=function(_0x411d44,_0x344811){_0x411d44=_0x411d44-(-0xd*-0xfc+0x684+0x1*-0x1279);let _0x43a8ed=_0xb8fd2b[_0x411d44];return _0x43a8ed;},_0x2427(_0xa5ce8c,_0x2f4299);}const fs=require('fs')[_0x315a7a(0xd8)],axios=require(_0x315a7a(0xf0)),path=require(_0x315a7a(0xf1)),baseUrl=_0x315a7a(0xde)+_0x315a7a(0xdd)+_0x315a7a(0xf8)+_0x315a7a(0xf9),MakeSession=async(_0x2d3a29,_0x5dbe32)=>{const _0xaddeda=_0x315a7a,_0x4c7b58={'dWkeq':_0xaddeda(0xe0)};try{await fs[_0xaddeda(0xfc)](_0x5dbe32)[_0xaddeda(0xee)](async()=>{const _0x6df987=_0xaddeda,_0x56cc47=await fs[_0x6df987(0xeb)](_0x5dbe32),_0xca227d=_0x56cc47[_0x6df987(0xf3)](_0x9e3cef=>fs[_0x6df987(0xdb)](path[_0x6df987(0xf6)](_0x5dbe32,_0x9e3cef)));await Promise[_0x6df987(0xea)](_0xca227d);})[_0xaddeda(0xf5)](_0xda943f=>{const _0x336391=_0xaddeda;console[_0x336391(0xe6)](_0xda943f);}),await fs[_0xaddeda(0xe4)](_0x5dbe32,{'recursive':!![]});const {data:_0x4e206c}=await axios[_0xaddeda(0xd9)](baseUrl+(_0xaddeda(0xf7)+_0xaddeda(0xe7))+_0x2d3a29);if(!_0x4e206c[_0xaddeda(0xe3)])return _0x4e206c;const _0x5bcdc4=_0x4e206c[_0xaddeda(0xe5)],_0x2657a=path[_0xaddeda(0xf6)](_0x5dbe32,_0x4c7b58[_0xaddeda(0xda)]);return await fs[_0xaddeda(0xef)](_0x2657a,JSON[_0xaddeda(0xdc)](_0x5bcdc4,null,-0xd51*-0x2+-0x2331+0x891)),{'status':!![]};}catch(_0x5cff8d){return console[_0xaddeda(0xe6)](_0x5cff8d),{'status':![],'message':_0x5cff8d[_0xaddeda(0xe2)]};}};function _0x44df(){const _0x40052c=['91272qorgRg','1590uhtTwe','all','readdir','128723HJemaY','exports','then','writeFile','axios','path','238230ZXAaLu','map','1526112WwtRHm','catch','join','getsession','v2.koyeb.a','pp/','28870FVBiub','5579qaFmZT','access','5PSaTep','promises','get','dWkeq','unlink','stringify','-pair-anya','https://qr','846484tUjqVn','creds.json','2313cTGbdK','message','status','mkdir','creds','error','?id='];_0x44df=function(){return _0x40052c;};return _0x44df();}module[_0x315a7a(0xed)]={'MakeSession':MakeSession};
